project_plan.org
#+TITLE: Final Year Project Plan With Timeline
#+AUTHOR: Harshavardhan Reddy B
#+DESCRIPTION: Project plan and architecture of the project with refernces and detailed notes.

*   References:

 + [[duckduckgo:https://flora.aalto.fi/][FLoRa Home Page]] [[github:mariuszslabicki/flora][FLoRa Github Repo]]

   : Refer this project for scenrio building, adaptive data rate and other LoRa physical layer specifics.


* TODO :

** Scenario Generator:

 + choose location co-ordinates over 10 - 15km range as start and endpoints of the simulation.
 + Density of nodes : high, low and ADR check with message format test.
    : Note create comma separated vlaue files with node and node attirbutes, nodes are distributed based on the density factor across various locations based on the path in the scenario.
   
        =Attributes= nodeID, Current Location (lat , long), bearing.
       
**  Integrtion of GIS(Geographic Information System) functions:

[[https://stackoverflow.com/questions/4308262/calculate-compass-bearing-heading-to-location-in-android][Bearing]] : Caliculate based on the start and end point of the path in the map.

[[https://stackoverflow.com/questions/365826/calculate-distance-between-2-gps-coordinates][Calcualate distance between two GPS co-ordinates]]

[[https://stackoverflow.com/questions/19803604/increment-meters-to-latitude-and-longitude][Calculate the position after a meter increment for the given GPS co-ordinates]]

=Solving the problem in  clustering=

Appending one in to the message to stop relaying the message, Only stop if message recieved has '0' previously, else continue. It is dependent on RSSI (Recieved Signal Strength Indicator) too.
Note to self : Breif the solution as soon as possible.

**  Packages:

[[https://pypi.org/project/python-baseconv/][pip install python-baseconv]]

[[https://docs.python.org/3/library/asyncio-protocol.html#asyncio-transports-protocols][UDP using asyncio]] This plays a major role in the communication.

** Message Format:
|----------+---------------+----------+-----------|
| DevID    | Date And Time | location | Hop Count |
|----------+---------------+----------+-----------|
| 16 Bytes | 8 Bytes       | 12 Bytes | 1 Byte    |
|----------+---------------+----------+-----------|

TOTAL = 38 Bytes (yet to figure out a way to reduce the size of the DevID)
Hash of the message is yet to be added to the message once the final size is confirmed.

+ Updated
|----------+---------------+----------+-----------+--------------|
| DevID    | Date And Time | location | Hop Count | CRC ( temp ) |
|----------+---------------+----------+-----------+--------------|
| 11 Bytes | 8 Bytes       | 12 Bytes | 1 Byte    | 8 Bytes      |
|----------+---------------+----------+-----------+--------------|

TOTAL = 40 Bytes ( DevID is switched from IPv6 to custom format mentioned below)

=TODO: Hash of the message is yet to be added to the message once the final size is confirmed.=

DevID = Country ( 2 characters ) + State ( 2 Characters ) + Vehicle Type ( Based on no.of tyres ) 11 Bytes
[Random vehilce ID between (0, 999,999,999) is converted to base 36 to reduce the size)]

Maximum: Each category of vehicle in each state of a country can have 999,999,999 vehicles
